RTEMS/rtems/bsps/arm/imxrt/mcux-sdk/drivers/qtmr_1/fsl_qtmr.c
    if ((base->CHANNEL[channel].CTRL & TMR_CTRL_DIR_MASK) != 0U)
    {
        /* Counting down */
        base->CHANNEL[channel].COMP2 = ticks - 1U;
    }
    else
    {
        /* Counting up */
        base->CHANNEL[channel].COMP1 = ticks - 1U;
    }
}

/*!
 * brief Set compare value.
 *
 * This function sets the value used for comparison with the counter value.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param ticks    Timer period in units of ticks.
 */
void QTMR_SetCompareValue(TMR_Type *base, qtmr_channel_selection_t channel, uint16_t ticks)
{
    base->CHANNEL[channel].CTRL |= TMR_CTRL_LENGTH_MASK;

    if ((base->CHANNEL[channel].CTRL & TMR_CTRL_DIR_MASK) != 0U)
    {
        /* Counting down */
        base->CHANNEL[channel].COMP2 = ticks;
    }
    else
    {
        /* Counting up */
        base->CHANNEL[channel].COMP1 = ticks;
    }
}

/*!
 * brief Enable the Quad Timer DMA.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param mask     The DMA to enable. This is a logical OR of members of the
 *                  enumeration ::qtmr_dma_enable_t
 */
void QTMR_EnableDma(TMR_Type *base, qtmr_channel_selection_t channel, uint32_t mask)
{
    uint16_t reg;

    reg = base->CHANNEL[channel].DMA;
    /* Input Edge Flag DMA Enable */
    if ((mask & (uint32_t)kQTMR_InputEdgeFlagDmaEnable) != 0U)
    {
        /* Restriction: Do not set both DMA[IEFDE] and SCTRL[IEFIE] */
        base->CHANNEL[channel].SCTRL &= (uint16_t)(~TMR_SCTRL_IEFIE_MASK);
        reg |= TMR_DMA_IEFDE_MASK;
    }
    /* Comparator Preload Register 1 DMA Enable */
    if ((mask & (uint32_t)kQTMR_ComparatorPreload1DmaEnable) != 0U)
    {
        reg |= TMR_DMA_CMPLD1DE_MASK;
    }
    /* Comparator Preload Register 2 DMA Enable */
    if ((mask & (uint32_t)kQTMR_ComparatorPreload2DmaEnable) != 0U)
    {
        reg |= TMR_DMA_CMPLD2DE_MASK;
    }
    base->CHANNEL[channel].DMA = reg;
}

/*!
 * brief Disable the Quad Timer DMA.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param mask     The DMA to enable. This is a logical OR of members of the
 *                  enumeration ::qtmr_dma_enable_t
 */
void QTMR_DisableDma(TMR_Type *base, qtmr_channel_selection_t channel, uint32_t mask)
{
    uint16_t reg;

    reg = base->CHANNEL[channel].DMA;
    /* Input Edge Flag DMA Enable */
    if ((mask & (uint32_t)kQTMR_InputEdgeFlagDmaEnable) != 0U)
    {
        reg &= ~(uint16_t)TMR_DMA_IEFDE_MASK;
    }
    /* Comparator Preload Register 1 DMA Enable */
    if ((mask & (uint32_t)kQTMR_ComparatorPreload1DmaEnable) != 0U)
    {
        reg &= ~(uint16_t)TMR_DMA_CMPLD1DE_MASK;
    }
    /* Comparator Preload Register 2 DMA Enable */
    if ((mask & (uint32_t)kQTMR_ComparatorPreload2DmaEnable) != 0U)
    {
        reg &= ~(uint16_t)TMR_DMA_CMPLD2DE_MASK;
    }
    base->CHANNEL[channel].DMA = reg;
}

/*!
 * brief Set PWM output in idle status (high or low).
 *
 * Note: When the PWM is set again, the counting needs to be restarted.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 * param idleStatus   True: PWM output is high in idle status; false: PWM output is low in idle status.
 */
void QTMR_SetPwmOutputToIdle(TMR_Type *base, qtmr_channel_selection_t channel, bool idleStatus)
{
    uint16_t reg = base->CHANNEL[channel].SCTRL;

    /* Stop qtimer channel counter first */
    base->CHANNEL[channel].CTRL &= (uint16_t)(~TMR_CTRL_CM_MASK);
    /* Clear count value */
    base->CHANNEL[channel].CNTR = 0U;

    if (0U != (reg & ((uint16_t)TMR_SCTRL_OPS_MASK)))
    {
        /* Inverted polarity. */
        reg |= (TMR_SCTRL_FORCE_MASK | TMR_SCTRL_VAL(!idleStatus));
    }
    else
    {
        /* True polarity. */
        reg |= (TMR_SCTRL_FORCE_MASK | TMR_SCTRL_VAL(idleStatus));
    }
    base->CHANNEL[channel].SCTRL = reg;

    s_qtmrGetPwmDutyCycle[channel] = 0x0;
}

/*!
 * brief Get the PWM channel dutycycle value.
 *
 * param base     Quad Timer peripheral base address
 * param channel  Quad Timer channel number
 *
 * return Current channel dutycycle value.
 */
uint8_t QTMR_GetPwmChannelStatus(TMR_Type *base, qtmr_channel_selection_t channel)
{
    return s_qtmrGetPwmDutyCycle[channel];
}

/*!
 * brief This function set the value of the prescaler on QTimer channels.
 *
 * param base         Quad Timer peripheral base address
 * param channel      Quad Timer channel number
 * param prescaler    Set prescaler value
 */
void QTMR_SetPwmClockMode(TMR_Type *base, qtmr_channel_selection_t channel, qtmr_primary_count_source_t prescaler)
{
    assert((uint32_t)prescaler > 7U);

    uint16_t reg = base->CHANNEL[channel].CTRL;

    /* Clear qtimer channel counter mode */
    base->CHANNEL[channel].CTRL = reg & (uint16_t)(~TMR_CTRL_CM_MASK);

    /* Set the new clock prescaler value and restore qtimer channel counter mode*/
    reg &= (uint16_t)(~(TMR_CTRL_PCS_MASK));
    reg |= TMR_CTRL_PCS(prescaler);
    base->CHANNEL[channel].CTRL = reg;
}
